In [1]:
import pandas as pd
libor = pd.read_csv('usd_3m_libor.csv')
tb = pd.read_csv('usd-3m-tb.csv')
libor.shape

(3914, 2)

In [2]:
tb.shape

(180, 2)

In [3]:
libor.head()

         DATE USD3MTD156N
0  2004-02-16        1.12
1  2004-02-17        1.12
2  2004-02-18        1.12
3  2004-02-19        1.12
4  2004-02-20        1.12

In [4]:
libor.dtypes

DATE           object
USD3MTD156N    object
dtype: object

In [5]:
libor['DATE'] = pd.to_datetime(libor['DATE'])

In [6]:
libor.dtypes

DATE           datetime64[ns]
USD3MTD156N            object
dtype: object

In [7]:
libor['by_month'] = libor['DATE'].dt.to_period('M')

In [8]:
libor.head()

        DATE USD3MTD156N by_month
0 2004-02-16        1.12  2004-02
1 2004-02-17        1.12  2004-02
2 2004-02-18        1.12  2004-02
3 2004-02-19        1.12  2004-02
4 2004-02-20        1.12  2004-02

In [10]:
libor_end_date = libor.groupby('by_month').tail(1)

In [12]:
libor_end_date = libor_end_date.drop(columns = "DATE", axis=1)

In [13]:
len(libor_end_date)

181

In [14]:
len(tb)

180

In [15]:
libor_end_date.tail()

     USD3MTD156N by_month
3837      2.5585  2018-10
3859     2.73613  2018-11
3880           .  2018-12
3903      2.7375  2019-01
3913     2.69388  2019-02

In [18]:
libor_End_date = libor_end_date.drop(3903)

In [19]:
libor_end_date = libor_End_date.drop(3913)

In [20]:
libor_end_date.tail()

     USD3MTD156N by_month
3794     2.32075  2018-08
3814     2.39838  2018-09
3837      2.5585  2018-10
3859     2.73613  2018-11
3880           .  2018-12

In [21]:
len(libor_end_date)

179

In [22]:
libor_rate = libor_end_date.rename(columns={'USD3mTD156N' : 'rate'})

In [23]:
libor_rate.head()

   USD3MTD156N by_month
9         1.12  2004-02
32        1.11  2004-03
54        1.18  2004-04
75           .  2004-05
97        1.61  2004-06

In [24]:
libor_rate = libor_rate.sort_values(by='by_month', ascending=False)

In [25]:
libor_rate.head()

     USD3MTD156N by_month
3880           .  2018-12
3859     2.73613  2018-11
3837      2.5585  2018-10
3814     2.39838  2018-09
3794     2.32075  2018-08

In [26]:
libor_rate.isnull().sum()

USD3MTD156N    0
by_month       0
dtype: int64

In [28]:
libor_rate.to_csv('libor_rate.csv')